{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 256, 256, 1], "ragged": false, "name": "conv1_input", "sparse": false}, "class_name": "InputLayer"}, {"config": {"dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv1", "padding": "valid", "activation": "relu", "groups": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 256, 256, 1], "use_bias": true, "kernel_constraint": null, "filters": 16}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "strides": [2, 2], "name": "max_pooling2d", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv2", "use_bias": true, "activation": "relu", "groups": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 16}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "trainable": true, "seed": null, "name": "dropout", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv3", "use_bias": true, "activation": "relu", "groups": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 16}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "strides": [3, 3], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "bias_constraint": null, "name": "conv4", "use_bias": true, "activation": "relu", "groups": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "dilation_rate": [1, 1], "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "filters": 16}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "strides": [3, 3], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "kernel_regularizer": null, "units": 16, "bias_constraint": null, "name": "dense", "use_bias": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "kernel_regularizer": null, "units": 3, "bias_constraint": null, "name": "dense_1", "use_bias": true, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential", "keras_version": "2.4.0"}